{
  "DEFAULT_FAILURE": "Une erreur inattendue est survenue",
  "DEFAULT_SUCCESS": "L'opération a réussi",
  "ITEM_NOT_FOUND": "Élément introuvable",
  "TOO_MANY_DESCENDANTS": "Un élément a trop de descendants pour que l'opération continue",
  "USER_CANNOT_READ_ITEM": "Vous ne pouvez pas voir cet élément",
  "USER_CANNOT_WRITE_ITEM": "Vous ne pouvez pas modifier cet élément",
  "USER_CANNOT_ADMIN_ITEM": "Vous ne pouvez pas modifier cet élément",
  "INVALID_MEMBERSHIP": "Vous ne pouvez pas appliquer une permission plus restrictive que celle définie par l'élément parent",
  "ITEM_MEMBERSHIP_NOT_FOUND": "Aucune permission n'a été trouvée pour cet utilisateur pour cet élément",
  "MODIFY_EXISTING": "Une permission a déjà été donnée à cet utilisateur pour cet élément. Modifiez la permission existante.",
  "INVALID_PERMISSION_LEVEL": "L'élément parent autorise déjà plus que la permission choisie",
  "HIERARCHY_TOO_DEEP": "Une erreur est survenue cat la hiérarchie est trop étendue",
  "TOO_MANY_CHILDREN": "Un élément a trop d'enfants pour que l'opération puisse continuer",
  "INVALID_MOVE_TARGET": "Vous ne pouvez pas déplacer des éléments dans l'élément choisi",
  "MEMBER_NOT_FOUND": "Un utilisateur n'a pas été trouvé",
  "CANNOT_MODIFY_OTHER_MEMBERS": "Vous ne pouvez pas modifier un autre utilisateur",
  "TOO_MANY_MEMBERSHIP": "Trop d'utilisateurs ont accès à cet élément pour que l'opération puisse continue",
  "MEMBER_CANNOT_ACCESS": "Un utilisateur n'a pas accès à cet élément",
  "MEMBER_ALREADY_SIGNED_UP": "Un compte existe déjà pour cet email, vous allez recevoir un email pour vous connecter",
  "MEMBER_NOT_SIGNED_UP": "Aucun compte n'existe pour cet email",
  "MEMBER_WITHOUT_PASSWORD": "Ce compte n'a pas configuré de mot de passe",
  "INCORRECT_PASSWORD": "Le mot de passe soumis est incorrect pour ce compte",
  "TOKEN_EXPIRED": "Votre session a expiré",
  "INVALID_TOKEN": "Votre session est invalide",
  "INVALID_SESSION": "Votre session a expiré",
  "ORPHAN_SESSION": "Votre session a expiré",
  "DATABASE_ERROR": "Une erreur est survenue dans la base de données",
  "UNEXPECTED_ERROR": "Une erreur inattendue est survenue",
  "EMAIL_ALREADY_TAKEN": "Cet e-mail est déjà pris",
  "STORAGE_EXCEEDED": "Vous avez rempli votre espace de stockage",
  "FILE_SIZE_NOT_FOUND": "Impossible de calculer la taille du fichier",
  "FILE_IS_NOT_IMAGE": "Le fichier n'est pas une image",
  "INVALID_UPLOAD_PARAMETERS": "Un ou plusieurs paramètres de mise en ligne sont invalides",
  "UPLOAD_EMPTY_FILE": "Impossible de mettre en ligne un fichier vide",
  "UPLOAD_TOO_MANY_FILES": "Impossible de télécharger trop de fichiers",
  "UPLOAD_BIG_FILES": "Impossible de télécharger de gros fichiers",
  "INVALID_FILE_PATH_FOR_COPY": "Le chemin du fichier est invalide pour la copie",
  "INVALID_FILE_PATH_FOR_DELETE": "Le chemin du fichier est invalide pour la suppression",
  "INVALID_FOLDER_PATH_FOR_DELETE": "Le chemin du dossier est invalide pour la suppression",
  "INVALID_DOWNLOAD_PARAMETERS": "Un ou plusieurs paramètres pour le téléchargement sont invalides",
  "LOCAL_FILE_NOT_FOUND": "Le fichier local n'a pas été trouvé",
  "S3_FILE_NOT_FOUND": "Le fichier S3 n'a pas été trouvé",
  "UPLOAD_FILE_UNEXPECTED_ERROR": "Une erreur inattendue s'est produite lors du téléversement d'un fichier",
  "DOWNLOAD_FILE_UNEXPECTED_ERROR": "Une erreur inattendue s'est produite lors du téléchargement d'un fichier",
  "RESTORE_ITEMS": "Les éléments ont été restorés avec succès",
  "CREATE_ITEM": "L'élément a été créé avec succès",
  "DELETE_ITEM": "L'élément a été supprimé avec succès",
  "DELETE_ITEMS": "Les éléments ont été supprimés avec succès",
  "MOVE_ITEM": "L'élément a été déplacé avec succès",
  "MOVE_ITEMS": "Les éléments ont été déplacés avec succès",
  "COPY_ITEM": "L'élément a été copié avec succès",
  "COPY_ITEMS": "Les éléments ont été copiés avec succès",
  "EDIT_ITEM": "L'élément a été modifié avec succès",
  "SHARE_ITEM": "L'élément a été partagé avec succès",
  "UPLOAD_FILES": "Les fichiers ont été sauvegardés avec succès",
  "SIGN_OUT": "Vous avez été déconnecté avec succès",
  "SIGN_IN": "Vos informations ont été validées, vous allez recevoir un mail pour vous connecter",
  "SIGN_IN_WITH_PASSWORD": "Vous avez été connecté avec succès",
  "SIGN_UP": "Vous avez été enregistré avec succès, vous allez recevoir un mail pour vous connecter",
  "EDIT_MEMBER": "L'utilisateur a été modifié avec succès",
  "COPY_MEMBER_ID_TO_CLIPBOARD": "L'ID utilisateur a été copié avec succès",
  "EDIT_ITEM_MEMBERSHIP": "La permission a été modifiée avec succès",
  "DELETE_ITEM_MEMBERSHIP": "La permission a été enlevée avec succès",
  "POST_ITEM_FLAG": "L'élément a été reporté avec succès",
  "COPY_ITEM_LINK_TO_CLIPBOARD": "Le lien a été copié avec succès",
  "RECYCLE_ITEM": "L'élément a été déplacé dans la poubelle avec succès",
  "RECYCLE_ITEMS": "Les éléments ont été déplacés dans la poubelle avec succès",
  "UPLOAD_ITEM_THUMBNAIL": "La miniature a été sauvegardé avec succès",
  "UPLOAD_AVATAR": "L'avatar a été sauvegardé avec succès",
  "IMPORT_ZIP": "L'archive ZIP a été importé avec succès",
  "IMPORT_H5P": "La librairie H5P a été importé avec succès",
  "DELETE_MEMBER": "Le compte a été supprimé avec succès",
  "UPDATE_PASSWORD": "Le mot de passe a été mis à jour avec succès",
  "UPDATE_EMAIL": "Une demande de validation a été envoyée à la nouvelle adresse email",
  "VALIDATE_EMAIL": "La nouvelle adresse email a été validée. Vous pouvez désormais l'utiliser pour vous connecter et recevoir des notifications.",
  "DELETE_ITEM_LOGIN_SCHEMA": "Le schéma de connexion de l'élément a été supprimé avec succès",
  "PUT_ITEM_LOGIN_SCHEMA": "Le schéma de connexion de l'élément a été mis à jour avec succès",
  "INVALID_ARCHIVE_FILE": "Le fichier soumis n'est pas une archive zip",
  "INVALID_FILE_ITEM": "Les propriétés du fichier sont invalides",
  "INVALID_ITEM_TYPE_FOR_DOWNLOAD": "Impossible de télécharger les données pour le type de cet élément",
  "UNEXPECTED_EXPORT_ERROR": "Une erreur est survenue durant l'exportation de l'archive zip",
  "NOT_APP_ITEM": "L'élément cible n'est pas une application",
  "INVALID_APP_ORIGIN": "L'application ne correspond pas à l'origine enregistrée",
  "TOKEN_ITEM_ID_MISMATCH": "Le jeton d'authentification ne correspond pas à l'élément cible",
  "APP_DATA_NOT_FOUND": "Aucunes données d'application trouvées",
  "APP_DATA_NOT_ACCESSIBLE": "Le membre ne peut pas demander cette donnée d'application",
  "APP_ACTION_NOT_ACCESSIBLE": "Le membre ne peut pas demander cette action d'application",
  "APP_SETTING_NOT_FOUND": "Aucuns paramètres d'application trouvés",
  "PREVENT_APP_DATA_FILE_UPDATE": "Les fichiers sauvés dans les données de l'application ne peuvent pas être mis à jour",
  "PREVENT_APP_SETTING_FILE_UPDATE": "Les fichier sauvés dans les paramètres de l'application ne peuvent pas être mis à jour",
  "FILE_SERVICE_NOT_DEFINED": "Le service de fichier ou le type de fichier n'est pas défini",
  "CANNOT_COPY_RECYCLED_ITEM": "Un élément supprimé ne peut pas être copié",
  "CANNOT_MOVE_RECYCLED_ITEM": "Un élément supprimé ne peut pas être déplacé",
  "CANNOT_DELETE_RECYCLED_ITEM": "Un élément supprimé ne peut pas être supprimé",
  "CANNOT_GET_RECYCLED_ITEM": "Un élément supprimé ne peut pas être lu",
  "INVALID_ITEM_STATUS": "L'élément ne satisfait pas les contraintes",
  "COPY_LINK_TO_CLIPBOARD_ERROR": "Impossible de copier le lien dans le press-papier",
  "COPY_LINK_TO_CLIPBOARD": "Lien copié dans le press-papier",
  "REQUEST_MESSAGES_RECYCLE_ITEMS": "Le ou les éléments sélectionnés seront mis à la corbeille. Cela peut prendre plusieurs minutes à s'appliquer.",
  "REQUEST_MESSAGES_MOVE_ITEMS": "Les éléments sélectionnés seront déplacés. Cela peut prendre plusieurs minutes à s'appliquer.",
  "REQUEST_MESSAGES_RESTORE_ITEMS": "Les éléments sélectionnés seront restaurés. Cela peut prendre plusieurs minutes à s'appliquer. C'est une bonne occasion de faire une pause.",
  "REQUEST_MESSAGES_DELETE_ITEMS": "Les éléments sélectionnés seront supprimés. Cela peut prendre plusieurs minutes à s'appliquer.",
  "PASSWORD_EMPTY_ERROR": "Entrez un mot de passe valide s'il vous plait",
  "PASSWORD_WEAK_ERROR": "Le nouveau mot de passe n'est pas assez robuste",
  "PASSWORD_EQUAL_ERROR": "Veuillez entrer un nouveau mot de passe différent de votre mot de passe actuel",
  "PASSWORD_CONFIRM_ERROR": "Veuillez vous assurer que le mot de passe et sa confirmation correspondent",
  "PASSWORD_NOT_DEFINED_ERROR": "Le mot de passe n'est pas défini",
  "PASSWORD_CONFLICT_ERROR": "Un mot de passe existe déjà, veuillez mettre à jour le mot de passe au lieu d'en créer un nouveau.",
  "INVALID_PASSWORD": "Le mot de passe actuel est invalide. Réessayez",
  "EMPTY_CURRENT_PASSWORD": "Le mot de passe actuel n'a pas été rempli. Réessayez",
  "REQUEST_MESSAGES_IMPORT_ZIP": "Le fichier ZIP est en cours de traitement. Une pause café s'impose, vous ne pensez pas ?",
  "REQUEST_MESSAGES_IMPORT_H5P": "Le fichier H5P est en cours de traitement. Patientez s'il-vous-plait.",
  "REQUEST_MESSAGES_UPLOAD_FILES": "Le ou les fichiers sont en file d'attente pour le téléversement. Patientez s'il-vous-plait.",
  "CREATE_SHORT_LINK": "Le lien court a été créé avec succès.",
  "EDIT_SHORT_LINK": "Le lien court a été mis à jour avec succès.",
  "DELETE_SHORT_LINK": "Le lien court a été supprimé avec succès.",
  "SHORT_LINK_ALREADY_EXISTS": "L'alias du lien court existe déjà.",
  "SHORT_LINK_NOT_FOUND": "Le lien court n'a pas été trouvé.",
  "INVALID_CONTEXT": "Le contexte donné n'est pas valide.",
  "SHORT_LINK_LIMIT_EXCEED": "Vous ne pouvez avoir qu'un seul lien court par service.",
  "POST_PROFILE": "Votre profil a été crée avec succès",
  "PATCH_PROFILE": "Votre profil a été enregistré avec succès",
  "PUT_ITEM_GEOLOCATION": "La géolocalisation a été enregistrée avec succès",
  "DELETE_ITEM_GEOLOCATION": "La géolocalisation a été supprimée avec succès",
  "DELETE_ITEM_THUMBNAIL": "La vignette a été supprimée avec succès",
  "REORDER_ITEM": "L'article a été ré-ordonné avec succès",
  "MEMBER_PROFILE_NOT_FOUND": "Profil de membre introuvable",
  "INSUFFICIENT_PERMISSION": "Le compte ne dispose pas des autorisations suffisantes pour effectuer cette action",
  "NOT_VALIDATED_MEMBER": "Le membre n'a pas validé son e-mail de compte",
  "NO_INVITATION_RECEIVED": "Aucune invitation reçue",
  "INVITATION_NOT_FOUND": "Invitation non trouvée",
  "INVITATION_CSV_MISSING_EMAIL_COLUMN": "La colonne obligatoire « email » n'a pas été fournie",
  "INVITATION_CSV_MISSING_GROUP_COLUMN": "La colonne obligatoire « group_name » n'a pas été fournie",
  "INVITATION_CSV_MISSING_EMAIL_IN_ROW": "Il manque une ligne contenant la valeur « email » requise",
  "INVITATION_CSV_MISSING_GROUP_IN_ROW": "Il manque une ligne contenant la valeur « group_name » requise",
  "INVITATION_CSV_NO_FILE_PROVIDED": "Aucun fichier n'a été fourni. Veuillez fournir un fichier pour créer des invitations groupées",
  "INVITATION_CSV_NO_DATA_IN_FILE": "Aucune donnée n'a été trouvée dans le fichier. Veuillez envoyer un fichier avec des données valides.",
  "INVITATION_CSV_TEMPLATE_ITEM_DOES_NOT_EXIST": "L'élément de modèle n'existe pas.",
  "INVITATION_CANNOT_CREATE_STRUCTURE_IN_NON_FOLDER_ITEM": "L'élément fourni n'est pas un dossier. Une structure ne peut pas être créée à l'intérieur d'un élément qui n'est pas un dossier.",
  "MEMBERSHIP_ALREADY_EXISTS": "Ce compte a déjà accès à cet élément.",
  "MEMBERSHIP_REQUEST_NOT_FOUND": "Demande d'adhésion fournie non trouvée."
}
